tutorials/pbeTransportFoam/TaylorCouette/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (79.89036   0 -4.18688)  // 0
    (96.36775   0 -5.05042)  // 1
    (96.36775 360 -5.05042)  // 2
    (79.89036 360 -4.18688)  // 3
    (79.89036   0  4.18688)  // 4
    (96.36775   0  5.05042)  // 5
    (96.36775 360  5.05042)  // 6
    (79.89036 360  4.18688)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (18 360 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall inlet
    (
        (1 5 4 0)
    )
    
    wall outlet
    (
        (3 7 6 2)
    )
    
    wall outerWall
    (
        (2 6 5 1)
    )
    
    wall innerWall
    (
        (0 4 7 3)
    )
    
    wedge wedge1
    (
        (0 1 2 3)
    )
    
    wedge wedge2
    (
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
