tutorials/pbeTransportFoam/TaylorCouette/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    "(U|h|e|k|epsilon|omega|R.*)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
    
    "moment.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1.0e-8;
        relTol          0;
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       1.0e5;

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        h               1e-4;

        "(k|epsilon|omega|R.*)" 1e-3;
    }
    

}

relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.3;
    }
    
    equations
    {
        U               0.3;
        h               0.1;
        "(k|epsilon|omega|R.*)" 0.4;
    }
}


// ************************************************************************* //
